import { Movie } from "../models/Movie";

export const movies: Movie[] = [
  {
    id: 1,
    title: "Тени прошлого",
    director: "Андрей Смирнов",
    year: 2022,
    description:
      "Детектив расследует загадочное исчезновение в маленьком городке, где каждый скрывает свою тайну.",
  },
  {
    id: 2,
    title: "Время надежды",
    director: "Екатерина Иванова",
    year: 2021,
    description:
      "История о молодой девушке, которая вопреки всему стремится осуществить свою мечту стать балериной.",
  },
  {
    id: 3,
    title: "Потерянный сигнал",
    director: "Дмитрий Козлов",
    year: 2023,
    description:
      "Группа ученых сталкивается с аномалией во время космической экспедиции и пытается вернуться домой.",
  },
  {
    id: 4,
    title: "Город без сна",
    director: "Мария Петрова",
    year: 2020,
    description:
      "В мегаполисе будущего журналист раскрывает заговор, угрожающий всему человечеству.",
  },
  {
    id: 5,
    title: "Последний лист",
    director: "Игорь Васильев",
    year: 2024,
    description:
      "Драматическая история о художнике, который находит вдохновение в самых трудных жизненных обстоятельствах.",
  },
];
